# Известно, что любое чётное число, большее 2, представимо в виде суммы 2 простых чисел, 
# причём таких разложений может быть несколько. Впервые гипотезу о существовании данного 
# разложения сформулировал математик Х. Гольдбах.

# Требуется написать программу, производящую согласно утверждению Гольдбаха, 
# разложение заданного чётного числа. Из всех пар простых чисел, сумма которых 
# равна заданному числу, требуется найти пару, содержащую наименьшее простое число.

# https://acmp.ru/asp/do/index.asp?main=task&id_course=1&id_section=6&id_topic=117&id_problem=723