# Задача: Создать информационную систему позволяющую работать с сотрудниками
# некой компании \ студентами вуза \ учениками школы
# (прямая отсылка к первому семинару “введение в базы данных”)

# Расписание (номер класса, номер урока, начало/конец урока, номер кабинета, учитель(null), предмет)
# Контактные данные ...
# Учителя (ФИО, др, номер, адрес, классное руководство(null), основной предмет, вход/выход в школу???)

import csv

text = 'id;Номер класса;Номер урока;Начало урока;Конец урока;Номер кабинета;Учитель;Предмет'

