# Задача: Создать калькулятор для работы с рациональными и комплексными числами, 
# организовать меню, добавив в неё систему логирования.
# print((1 + 2j) - (2 - 7j))
# complex()

from Menu import start

if __name__ == '__main__':
    start()
